var array = ["అ","ఆ","ఇ","ఈ","ఉ","ఊ","ఋ","ఎ","ఏ","ఐ","ఒ","ఓ","ఔ","అం","అః","క","ఖ","గ","ఘ","ఙ","చ","ఛ","జ","ఝ","ఞ","ట","ఠ","డ","ఢ","ణ","త","థ","ద","ధ","న","ప","ఫ","బ","భ","మ","య","ర","ల","వ","శ","ష","స","హ","ళ","క్ష","ఱ","క","కా","కి","కీ","కు","కూ","కృ","కె","కే","కై","కొ","కో","కౌ","కం","కః","క్","ఖ","ఖా","ఖి","ఖీ","ఖు","ఖూ","ఖృ","ఖె","ఖే","ఖై","ఖొ","ఖో","ఖౌ","ఖం","ఖః","ఖ","గ","గా","గి","గీ","గు","గూ","గృ","గె","గే","గై","గొ","గో","గౌ","గం","గః","గ్","ఘ","ఘా","ఘి","ఘీ","ఘు","ఘూ","ఘృ","ఘే","ఘై","ఘొ","ఘో","ఘౌ","ఘం","ఘః","ఘ్","ఙ","ఙా","ఙి","ఙీ","ఙు","ఙూ","ఙృ","ఙె","ఙే","ఙై","ఙొ","ఙో","ఙౌ","ఙం","ఙః","ఙ్","చ","చా","చి","చీ","చు","చూ","చృ","చె","చే","చై","చొ","చో","చౌ","చ","చః","చ్","ఛ","ఛా","ఛి","ఛీ","ఛు","ఛూ","ఛృ","ఛె","ఛే","ఛై","ఛొ","ఛో","ఛౌ","ఛం","ఛః","ఛ్","జ","జా","జి","జీ","జు","జూ","జృ","జె","జే","జై","జొ","జో","జౌ","జం","జః","జ్","ఝ","ఝా","ఝి","ఝీ","ఝు","ఝూ","ఝృ","ఝె","ఝే","ఝై","ఝొ","ఝో","ఝౌ","ఝం","ఝః","ఝ్","ఞ","ఞా","ఞి","ఞీ","ఞు","ఞూ","ఞృ","ఞె","ఞే","ఞై","ఞొ","ఞో","ఞౌ","ఞం","ఞః","ఞ్","ట","టా","టి","టీ","టు","టూ","టృ","టె","టే","టై","టొ","టో","టౌ","టం","టః","ట్","ఠ","ఠా","ఠి","ఠీ","ఠు","ఠూ","ఠృ","ఠె","ఠే","ఠై","ఠొ","ఠో","ఠౌ","ఠం","ఠః","ఠ్","డ","డా","డి","డీ","డు","డూ","డృ","డె","డే","డై","డొ","డో","డౌ","డం","డః","డ్","ఢ","ఢా","ఢి","ఢీ","ఢు","ఢూ","ఢృ","ఢె","ఢే","ఢై","ఢొ","ఢో","ఢౌ","ఢం","ఢః","ఢ్","ణ","ణా","ణి","ణీ","ణు","ణూ","ణృ","ణె","ణే","ణై","ణొ","ణో","ణౌ","ణం","ణః","ణ్","త","తా","తి","తీ","తు","తూ","తృ","తె","తే","తై","తొ","తో","తౌ","తం","తః","త్","థ","థా","థి","థీ","థు","థూ","థృ","థె","థే","థై","థొ","థో","థౌ","థం","థః","థ్","ద","దా","ది","దీ","దు","దూ","దృ","దె","దే","దై","దొ","దో","దౌ","దం","దః","ద్","ధ","ధా","ధి","ధీ","ధు","ధూ","ధృ","ధె","ధే","ధై","ధొ","ధో","ధౌ","ధం","ధః","ధ్","న","నా","ని","నీ","ను","నూ","నృ","నె","నే","నై","నొ","నో","నౌ","నం","నః","న్","ప","పా","పి","పీ","పు","పూ","పృ","పె","పే","పై","పొ","పో","పౌ","పం","పః","ప్","ఫ","ఫా","ఫి","ఫీ","ఫు","ఫూ","ఫృ","ఫె","ఫే","ఫై","ఫొ","ఫో","ఫౌ","ఫం","ఫః","ఫ్","బ","బా","బి","బీ","బు","బూ","బృ","బె","బే","బై","బొ","బో","బౌ","బం","బః","బ్","భ","భ","భి","భీ","భు","భూ","భృ","భె","భే","భై","భొ","భో","భౌ","భం","భః","భ్","మ","మా","మి","మీ","ము","మూ","మృ","మె","మే","మై","మొ","మో","మౌ","మం","మః","మ్","య","యా","యి","యీ","యు","యూ","యృ","యె","యే","యై","యొ","యో","యౌ","యం","యః","య్","ర","రా","రి","రీ","రు","రూ","రృ","రె","రే","రై","రొ","రో","రౌ","రం","రః","ర్","ల","లా","లి","లీ","లు","లూ","లృ","లె","లే","లై","లొ","లో","లౌ","లం","లః","ల్","వ","వా","వి","వీ","వు","వూ","వృ","వె","వే","వై","వొ","వో","వౌ","వం","వః","వ్","శ","శా","శి","శీ","శు","శూ","శృ","శె","శే","శై","శొ","శో","శౌ","శం","శః","శ్","ష","షా","షి","షీ","షు","షూ","షృ","షె","షే","షై","షొ","షో","షౌ ","షం","షః"," ష్","స","సా","సి","సీ","సు","సూ","సృ","సె"," సే ","సై"," సొ"," సో","సౌ","సం","సః ","స్","హ","హా ","హి","హీ","హు","హూ","హృ","హె","హే"," హై","హొ","హో","హౌ","హం","హః","హ్","ళ","ళా","ళి","ళీ","ళు","ళూ","ళృ","ళె","ళే","ళై","ళొ","ళో","ళౌ","ళం","ళః","ళ్","క్ష","క్షా","క్షి","క్షీ","క్షు","క్షూ","క్షృ","క్షె","క్షే ","క్షై","క్షొ ","క్షో","క్షౌ","క్షం","క్షః క్ష్","ఱ","ఱా ","ఱి","ఱీ","ఱు","ఱూ","ఱృ","ఱె","ఱే","ఱై","ఱొ ","ఱో ","ఱౌ","ఱం","ఱః","ఱ్"];

var points=0;
  
  var d=['ఎల','ఎక్కడ','ఎప్పుడు','ఎవరు','ఏది','ఎంత','ఎన్ని','వద్దు','లేదు','కాదు','రాదు','బాలేదు','తెలియదు','నాకు','కాలేదు','భాష','నాపేరు','ఉంది','ఎలా','ఉన్నారు','ఎక్కడికి','ఏంటి','ఎక్కడ','ఎందుకు','ఎవరు','ఎలా','ఏమి','ఉంది','లేదు','నాకు','కావాలి','మాసం','సంవత్సరం','మాసం','తేది','నూతన','ఇది','చాలా','బాగుంది','మీరు','ఎక్కడ','నను','సినిమా','చూస్తున్నాను','ఉంది','తరువు','తరవండి','అవును','నాకోసం','మీకోసం','నకోసం','కాదు','అవును','ఎంత','కాలేదు','నాకు','సున్న','ఒక','రెండు','మూడు','నాలుగు','ఐదు','ఆరు','ఏడు','ఎనిమిది','తొమ్మిది','పది','పదకొందు','పన్నెండు','పదమూడు','పద్నాలుగు','పదిహేను','పదహారు','పదిహేడు','పద్దెనిమిది','పంతొమ్మిది','ఇరవై','ఇరవైఒకటి','ఇరవైరెండు','ఇరవైమూడు','నలబై','వంద' ,'వెయ్యి','రెండువేలు','కోటి','సగం','ముందు','ఉదయం','రాత్రి','ఒక','గంటలు','ఒక్క','క్షణం','నిమిషాలు','గంటలు','రోజు','వారం','నెల','రోజు' ,'నేడు','నేడు','రేపు','ఈవారం','గత','వారం','వారం','ఆది','సోమ','మంగళ','బుధ','గురు','శుక్ర','శని','మాఘము','ఆషాఢము','రంగు','నలుపు'];     


var randomArray = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
var word = "";

console.log(array);
//sets array variables to random numbers
function CreateLottoValues() {
  for (var i=0; i<randomArray.length; i++) {
    randomArray[i] = array[Math.floor(Math.random() * array.length)]; 
  }
}

//create table
function UpdateTable() {
	var random = document.getElementById('result');
	var random1 = document.getElementById('result1');
  CreateLottoValues();
  for (var i=0; i<randomArray.length; i++) {
    tmp = 'cell'+(i+1);
    document.getElementById(tmp).innerHTML = randomArray[i]; 
    document.getElementById(tmp).value = randomArray[i]; 
    console.log(document.getElementById(tmp).value);
    random.innerHTML="";
    random1.innerHTML="";
    word = "";
  }
}



function haha(objButton) 
{
	
	var random = document.getElementById('result');
	random.innerHTML += objButton.value;

	word = word+ objButton.value;
	console.log(word);

}

function Check(){
	var random1 = document.getElementById('result1');
		console.log('inside check '+ word);
		console.log('index is ' + d.indexOf(word));
		if (d.indexOf(word) > -1){
				points += 5;
				random1.innerHTML = 'You collected ' + points + ' points.';
				word = "";
				document.getElementById('result').innerHTML = ""; 
	}

		else{
			random1.innerHTML = 'Word not found';
			word = "";
			document.getElementById('result').innerHTML = ""; 
			
		}
}


var myVar = setInterval(function(){ setColor() }, 300);
 
function setColor() {
  var x = document.body;
  x.style.backgroundColor = x.style.backgroundColor == "yellow" ? "pink" : "yellow";
}








